Repository: alessandronogueiraporto/appcine
Catalog: cine/web/sites/default/files/translations/crop-8.x-2.3.*.po
Languages: pt_br

source: Delete
pt_br: Apagar

source: Type
pt_br: Tipo

source: Description
pt_br: Descrição

source: File
pt_br: Arquivo

source: Name
pt_br: Nome

source: View
pt_br: Ver

source: Revision ID
pt_br: ID da revisão

source: Width
pt_br: Largura

source: Height
pt_br: Altura

source: Media
pt_br: Mídia

source: Configuration
pt_br: Configurações

source: Used in
pt_br: Usado em

source: Language code
pt_br: Código do idioma

source: About
pt_br: Sobre

source: Crop
pt_br: Recortar

source: Entity type
pt_br: Tipo de entidade

source: Aspect ratio
pt_br: Aspecto proporcional

source: Machine-readable name
pt_br: Nome legível de máquina

source: Image field
pt_br: Campo de imagem

source: Hard limit
pt_br: Limite rígido

source: Entity ID
pt_br: ID da entidade

source: Manual crop
pt_br: Corte manual

source: Aspect Ratio
pt_br: Aspecto Proporcional

source: Soft limit
pt_br: Limite macio

source: Third party settings
pt_br: Configurações de terceiros

source: %type is used by 1 piece of content on your site. You can not remove this content type until you have removed all of the %type content.
pt_br: %type é usado por 1 pedaço de conteúdo em seu site. Você não pode remover esse tipo de conteúdo até remover todo o conteúdo %type.

source: Revision timestamp
pt_br: Registro de data e hora da revisão

source: The node language code.
pt_br: O código de idioma do node.

source: The time that the current revision was created.
pt_br: O horário de criação da revisão atual.

source: The user ID of the author of the current revision.
pt_br: O ID do usuário autor da revisão atual.

source: The log entry explaining the changes in this revision.
pt_br: A entrada de log que explica as mudanças nesta revisão.

source: Revision Log
pt_br: Log de Revisão

source: Crop configuration
pt_br: Configuração de recorte

source: There are no file or image fields on this bundle at the moment. In order to configure crop add at least one such field and come back.
pt_br: Não há nenhum arquivo ou campos de imagem neste pacote no momento. Para configurar o recorte, adicione pelo menos um desses campos e retorne.

source: Select field that stores image which needs to be cropped.
pt_br: Selecione o campo que armazena imagens que precisam ser recortadas.

source: Provides storage and API for image crops.
pt_br: Fornece armazenamento e API para recorte de imagens.

source: Add crop type
pt_br: Adicionar tipo de recorte

source: Crop types
pt_br: Tipos de recortes

source: Manage crop types.
pt_br: Gerencie os tipos de recortes.

source: Administer crop settings
pt_br: Administrar as configurações de recortes

source: Administer the basic settings for Crop API.
pt_br: Administre as configurações básicas para a Crop API.

source: Administer crop types
pt_br: Administrar tipos de recortes

source: Administer crop types.
pt_br: Administrar tipos de recortes.

source: Crop type
pt_br: Tipo de recorte

source: Crop settings
pt_br: Configurações de recortes

source: Field storing image to be cropped
pt_br: Campo de armazenamento de imagem para recortar

source: Crop effect configuration
pt_br: Configuração do efeito de recorte

source: Media entity crop
pt_br: Recorte de entidade de mídia

source: No crop types available. <a href="@link">Add crop type</a>.
pt_br: Não há tipos de recortes disponíveis. <a href="@link">Adicionar tipo de recorte</a>.

source: Entity provider @id not found.
pt_br: O provedor de entidades @id não foi encontrado.

source: Crop ID
pt_br: ID do recorte

source: The crop ID.
pt_br: O ID do recorte.

source: The crop UUID.
pt_br: O UUID do recorte.

source: The crop revision ID.
pt_br: O ID da revisão do recorte.

source: The crop type.
pt_br: O tipo de recorte.

source: ID of entity crop belongs to.
pt_br: ID da entidade da qual o recorte pertence.

source: The type of entity crop belongs to.
pt_br: O tipo de entidade que o recorte pertence.

source: The URI of the image crop belongs to.
pt_br: A URI da imagem que o recorte pertence.

source: The crop height.
pt_br: A altura do recorte.

source: The crop width.
pt_br: A largura do recorte.

source: X coordinate
pt_br: Coordenada X

source: The crop's X coordinate.
pt_br: A coordenada X do recorte.

source: Y coordinate
pt_br: Coordenada Y

source: The crop's Y coordinate.
pt_br: A coordenadaY do recorte.

source: Revision author ID
pt_br: ID do autor da revisão

source: Are you sure you want to delete the crop type %type?
pt_br: Tem certeza que deseja excluir o tipo de recorte %type?

source: The crop type %name has been deleted.
pt_br: O tipo de recorte %name foi excluído.

source: Deleted crop type %name.
pt_br: Tipo de recorte %name excluído.

source: Edit %label crop type
pt_br: Editar tipo de recorte %label

source: The human-readable name of this crop type. This name must be unique.
pt_br: O nome humano deste tipo de recorte. Este nome deve ser único.

source: A unique machine-readable name for this crop type. It must only contain lowercase letters, numbers, and underscores.
pt_br: Um nome único legível por máquina para este tipo de recorte. Ele deve conter somente letras minúsculas, números e sublinhados.

source: Describe this crop type.
pt_br: Descreva este tipo de recorte.

source: Set an aspect ratio <b>eg: 16:9</b> or leave this empty for arbitrary aspect ratio
pt_br: Defina uma proporção <b>por exemplo: 16:9</b> ou deixe vazio para uma proporção arbitrária

source: Save crop type
pt_br: Salvar o tipo de recorte

source: Delete crop type
pt_br: Excluir o tipo de recorte

source: The crop type %name has been updated.
pt_br: O tipo de recorte %name foi atualizado.

source: The crop type %name has been added.
pt_br: O tipo de recorte %name foi adicionado.

source: Added crop type %name.
pt_br: Adicionado tipo de recorte %name.

source: Provides crop integration for core files.
pt_br: Fornece integração de recortes para arquivos do core.

source: Crop type to be used for the image style.
pt_br: Tipo de recorte para ser usado para o estilo de imagem.

source: Manual image crop failed due to misconfigured crop type on %path.
pt_br: O recorte manual de imagem falhou devido ao tipo de recorte mal configurado em %path.

source: Manual image crop failed using the %toolkit toolkit on %path (%mimetype, %width x %height)
pt_br: O recorte manual de imagem falhou usando o kit de ferramentas %toolkit em %path (%mimetype, %width x %height)

source: Applies manually provided crop to the image.
pt_br: Aplicar manualmente o recorte fornecido na imagem.

# Validation
source: Crop Type aspect ratio
pt_br: Proporção de aspecto do tipo de recorte

source: Invalid aspect ratio format. Should be defined in H:W form.
pt_br: Formato de proporção de aspecto inválido. Deve ser definido no formato H:W.

# Validation
source: Crop Type machine name
pt_br: Nome de máquina do tipo de recorte

source: Invalid machine-readable name.
pt_br: Nome de máquina inválido.

source: uses <em>@data.crop_type</em> crop type
pt_br: usar <em>@data.crop_type</em> tipo de recorte

source: Soft limit width
pt_br: Largura do limite macio

source: Soft limit height
pt_br: Altura do limite macio

source: Hard limit width
pt_br: Largura do limite rígido

source: Hard limit height
pt_br: Altura do limite rígido

source: @first, @second and @count more
pt_br: @first, @second e @count mais

source: Define crop size soft limit. Warning will be displayed if crop smaller than that is selected.
pt_br: Defina o limite macio do tamanho do recorte. O aviso será exibido se o recorte for menor do que o selecionado.

source: Limit for width.
pt_br: Limite para largura.

source: Limit for height.
pt_br: Limite para altura.

source: Limit for width
pt_br: Limite para largura

source: - Skip field -
pt_br: - Pular campo -

source: Crop API settings
pt_br: Configurações da Crop API

source: Indicates whether to flush image derivatives when a crop entity is change
pt_br: Indica se as imagens derivadas devem ser excluídas quando uma entidade de recorte é alterada

source: Define crop size hard limit. User is not allowed to make a smaller selection than defined here.
pt_br: Defina o limite rígido do tamanho do recorte. O usuário não pode fazer uma seleção menor do que está definido aqui.

source: This branch of Crop API is not compatible with the version of Media Entity installed.
pt_br: Este branch da Crop API não é compatível com a versão da Media Entity instalada.

source: Provides crop integration for media.
pt_br: Fornece integração de recortes para mídias.

source: Deprecated.
pt_br: Descontinuado.

source: - Select a Provider -
pt_br: - Selecione um Provedor -

source: <a href=':crop'>Crop</a> provides basic API for image cropping. This module won't do much by itself. Users should pick one of UI modules that utilize this API.</a>
pt_br: <a href=':crop'>Crop</a> fornece uma API básica para recorte de imagem. Este módulo não fará muito sozinho. Os usuários devem escolher um dos módulos de interface do usuário que utilizam esta API.</a>

source: This is API module. In order to crop your images you need a UI module. There are currently two UI modules that use Crop API:
pt_br: Este é o módulo API. Para recortar suas imagens, você precisa de um módulo de interface do usuário. Atualmente, existem dois módulos de interface do usuário que usam a Crop API:

source: Technical details
pt_br: Detalhes técnicos

source: Initial discussion can be found on <a href=":manual">manual crop issue queue</a>.
pt_br: A discussão inicial pode ser encontrada na <a href=":manual">manual crop issue queue</a>.

source: Automatic crop provider
pt_br: Provedor de recortes automáticos

source: The name of automatic crop provider to use if crop is not set for an image.
pt_br: O nome do provedor de recorte automático que será usado caso não tenha sido definido um recorte para uma imagem.
